Forbes_Billionaires_Analysis

**Importing librari**

In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [ ]:
# Colors using in project 

colors = ["#54bebe", "#76c8c8", "#98d1d1", "#badbdb", "#dedad2", "#e4bcad", "#df979e", "#d7658b", "#c80064"]

In [3]:
# Reading data

df = pd.read_csv('forbes_billionaires_geo.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2755 entries, 0 to 2754
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         2755 non-null   object
 1   NetWorth     2755 non-null   float64
 2   Country      2755 non-null   object
 3   Source       2755 non-null   object
 4   Rank         2755 non-null   int64
 5   Age          2630 non-null   float64
 6   Residence    2715 non-null   object
 7   Citizenship  2739 non-null   object
 8   Status       2090 non-null   object
 9   Children     1552 non-null   float64
 10  Education    1409 non-null   object
 11  Self_made    2737 non-null   object
 12  geometry     2755 non-null   object
dtypes: float64(3), int64(1), object(9)
memory usage: 279.9+ KB

In [5]:
df.isnull().sum()

Name              0
NetWorth          0
Country           0
Source            0
Rank              0
Age             125
Residence        40
Citizenship      16
Status          665
Children       1203
Education      1346
Self_made        18
geometry          0
dtype: int64

In [7]:
df.sample(5)

,Name,NetWorth,Country,Source,Rank,Age,Residence,Citizenship,Status,Children,Education,Self_made,geometry
494,Teh Hong Piow,5.7,Malaysia,banking,486,91.0,"Kuala Lumpur, Malaysia",Malaysia,Married,4.0,"Bachelor of Arts/Science, University of Malaya",True,POINT (101.6942371 3.1516964)
370,Juan Francisco Beckmann Vidal & family,7.0,Mexico,tequila,369,81.0,"Mexico City, Mexico",Mexico,Married,NaN,NaN,False,POINT (-99.1331785 19.4326296)
2305,Zbigniew Juroszek & family,1.3,Poland,"real estate, gambling",2263,58.0,"Cieszyn, Poland",Poland,NaN,NaN,NaN,True,POINT (18.6562313 49.7557676)
1988,Kentaro Ogawa,1.6,Japan,restaurants,1931,72.0,"Tokyo, Japan",Japan,Married,NaN,NaN,True,POINT (139.7594549 35.6828387)
1180,James Jannard,2.7,United States,sunglasses,1174,71.0,"San Juan Islands, Washington",United States,Married,4.0,"Drop Out, University of Southern California",True,POINT (-118.4630907 33.9809608)

**Data correction**

*Lower letters for all column*

*Drop Coulumns: Residence and Citizenship*

*Changing Nan to 0*